---
kind: property
id: P:Autodesk.Revit.DB.Visual.AssetSet.IsEmpty
source: html/b3570658-9eb0-3635-862a-32b2ac44a3b8.htm
---
# Autodesk.Revit.DB.Visual.AssetSet.IsEmpty Property

## Syntax (C#)
```csharp
public virtual bool IsEmpty { get; }
```